docs/docs/thinking-wikipedia.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"https://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="https://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-09 月 11:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>クラウドと情報リテラシー 思考 (wikipediaより)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="suzuki@iwate-u.ac.jp" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href=".././styles/sos/css/sos.css">
<link rel="stylesheet" type="text/css" href=".././styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">クラウドと情報リテラシー 思考 (wikipediaより)</h1>

<div id="outline-container-org18f663d" class="outline-2">
<h2 id="org18f663d">思考</h2>
<div class="outline-text-2" id="text-org18f663d">
<p>
出展: <a href="https://ja.wikipedia.org/wiki/%E6%80%9D%E8%80%83">https://ja.wikipedia.org/wiki/思考</a> 
</p>
</div>

<div id="outline-container-orge4482b4" class="outline-3">
<h3 id="orge4482b4">思考*（しこう、<a href="file:///wiki/%E8%8B%B1%E8%AA%9E">英</a>:Thinking）は、</h3>
<div class="outline-text-3" id="text-orge4482b4">
<p>
結論を導き出すなど何かしら一定の状態に達しようとする過程において、筋道
や方法など模索する精神の活動である。
</p>

<ul class="org-ul">
<li>広義には<a href="file:///wiki/%E4%BA%BA%E9%96%93">人間</a>が持つ知的作用を総称する言葉、</li>
<li>狭義では<a href="file:///wiki/%E6%A6%82%E5%BF%B5">概念</a>・<a href="file:///wiki/%E5%88%A4%E6%96%AD">判断</a>・<a href="file:///wiki/%E6%8E%A8%E7%90%86">推理</a>を行うことを指す。</li>
<li>知的<a href="file:///wiki/%E7%9B%B4%E6%84%9F">直感</a>を含める場合もあるが</li>
<li><a href="file:///wiki/%E6%84%9F%E6%80%A7">感性</a>や意欲とは区別される。</li>
</ul>
</div>
</div>

<div id="outline-container-org3b99296" class="outline-3">
<h3 id="org3b99296">思考の意味</h3>
<div class="outline-text-3" id="text-org3b99296">
</div>
<div id="outline-container-orgda79aed" class="outline-4">
<h4 id="orgda79aed">広義と狭義</h4>
<div class="outline-text-4" id="text-orgda79aed">
<ul class="org-ul">
<li>何らかの事象や<a href="file:///wiki/%E7%9B%AE%E6%A8%99">目標</a>などの対象について考える働きまたは過程の事</li>
<li>対象となるものの意味を知る、または意味づけを行うこと</li>
</ul>

<p>
これには二つの意味がある。
</p>

<ul class="org-ul">
<li>広義には「心」が動くことそのものを言い「内化された心像・概念・言語を
操作すること</li>

<li><p>
狭義には、何らかの目標達成や問題解決のために行う一連の<a href="file:///wiki/%E6%83%85%E5%A0%B1%E5%87%A6%E7%90%86">情報処理</a>を指し、
思考する対象の意味を理解しながら進められる認知的な行動である。
</p>

<p>
ここで思考が使う<a href="file:///wiki/%E6%83%85%E5%A0%B1">情報</a>とは、記憶の中に<a href="file:///wiki/%E5%88%86%E5%B8%83">分布</a>する<a href="file:///wiki/%E3%83%9B%E3%83%AD%E3%82%B0%E3%83%A9%E3%83%A0">ホログラム</a>と言える。そし
て思考は、組織化された外部情報を成分要素とする内的な<a href="file:///wiki/%E3%82%B7%E3%83%9F%E3%83%A5%E3%83%AC%E3%83%BC%E3%82%B7%E3%83%A7%E3%83%B3">シミュレーション</a>
と定義される。これによって人間は様々な予測を得る。
</p></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgee6c83f" class="outline-3">
<h3 id="orgee6c83f">思考と情報</h3>
<div class="outline-text-3" id="text-orgee6c83f">
<p>
思考とは、心に色々な事柄を思い浮かべる（心像：mental image）行動を通じ
て、それらの関係を構築する作業である。この心像には、<a href="file:///wiki/%E4%BA%94%E6%84%9F">五感</a>で受け取った像
（知覚心像）と、それらを脳内で再構成した像（記憶心像）があり、思考では
この2種類の心像を複数照会し合いながら同定し、判断に至る作業を行う。
</p>

<p>
思考は人間が直面する問題を解決するために問題と状況を「理解」し「解」を
導き出す心の働きである点から、対象について多角的なアプローチが行われつ
つ検討が繰り返されるため、漸進的でありかつ累積的に進むところを特徴とす
る。
</p>

<p>
また、思考は心の働きではあるが閉じている訳ではなく、外部から得る情
報を取り込みながら行われる。この情報とは、<a href="file:///wiki/%E7%9F%AD%E6%9C%9F%E8%A8%98%E6%86%B6">短期記憶</a>や思考する際に五感か
ら得られた外的情報でなければならない事は無く、過去に得た知識を用いた経
験的な<a href="file:///wiki/%E9%95%B7%E6%9C%9F%E8%A8%98%E6%86%B6">長期記憶</a>や<a href="file:///wiki/%E9%80%A3%E6%83%B3">連想</a>などだけでもよい。
</p>
</div>

<div id="outline-container-org18f9b35" class="outline-4">
<h4 id="org18f9b35"><a href="file:///wiki/%E3%82%B3%E3%83%B3%E3%83%94%E3%83%A5%E3%83%BC%E3%82%BF">コンピュータ</a>などの<a href="file:///wiki/%E6%83%85%E5%A0%B1%E6%A9%9F%E5%99%A8">情報機器</a>は、思考を手助けする有効なツールである。</h4>
<div class="outline-text-4" id="text-org18f9b35">
<p>
<a href="file:///wiki/%E3%82%B3%E3%83%B3%E3%83%94%E3%83%A5%E3%83%BC%E3%82%BF">コンピュータ</a>など<a href="file:///wiki/%E6%83%85%E5%A0%B1%E6%A9%9F%E5%99%A8">情報機器</a>は、思考を支援することができる。
</p>

<ul class="org-ul">
<li>思考する対象の情報を得て理解する段階にて、
<ul class="org-ul">
<li>情報を得る早さや</li>
<li><a href="file:///wiki/%E6%A4%9C%E7%B4%A2">検索</a>機能など適切な情報に行き当たる<a href="file:///wiki/%E7%A2%BA%E7%8E%87">確率</a>の向上、</li>
<li>そして絶対的な情報<a href="file:///wiki/%E9%87%8F">量</a>の多さや</li>
<li><a href="file:///wiki/%E7%B5%B1%E8%A8%88">統計</a>的な整理、</li>
<li><a href="file:///wiki/%E5%9B%B3%E6%A1%88">図案</a>化など理解しやすい表現などが可能となる。</li>
</ul></li>

<li>洞察を深め<a href="file:///wiki/%E7%99%BA%E6%83%B3">発想</a>に繋がる。
<ul class="org-ul">
<li>具体例を示したり、</li>
<li>情報の属性に応じた検索など</li>
</ul></li>

<li>思考過程を一部外化している
<ul class="org-ul">
<li>記憶の蓄積や操作、</li>
<li>整理統合にも役立ち、</li>
</ul></li>
</ul>

<p>
「統合的思考支援環境」の開発は、情報処理機器の研究開発が目指すひとつの
目標となっている。
</p>
</div>
</div>
</div>


<div id="outline-container-org4ce201e" class="outline-3">
<h3 id="org4ce201e">思考の過程</h3>
<div class="outline-text-3" id="text-org4ce201e">
<p>
思考とは、複雑な内的過程を経て結論へ導かれる考えである。
</p>
</div>

<div id="outline-container-org6de9eca" class="outline-4">
<h4 id="org6de9eca">次の例では、思考過程を5つの過程で説明する。</h4>
<div class="outline-text-4" id="text-org6de9eca">
<ol class="org-ol">
<li><a href="file:///wiki/%E5%88%86%E6%9E%90">分析</a>では、単位情報をそれが持つ要素や性質まで分解すること</li>
<li><a href="file:///wiki/%E7%B7%8F%E5%90%88">総合</a>では、分解した要素や性質に着目し情報を結合させること</li>
<li><a href="file:///wiki/%E6%AF%94%E8%BC%83">比較</a>では、分解した要素や性質を比較して情報間の相違や類似部分を洗い出すこと</li>
<li><a href="file:///wiki/%E6%8A%BD%E8%B1%A1">抽象</a>では、情報の本質は何かを見出すこと</li>
<li><a href="file:///w/index.php?title=%E6%A6%82%E6%8B%AC&amp;action=edit&amp;redlink=1">概括</a>では、見出した情報の本質をまとめ上げること</li>
</ol>
</div>
</div>

<div id="outline-container-org07f40e8" class="outline-4">
<h4 id="org07f40e8">思考‐言語を相関させた3段階で成された説明</h4>
<div class="outline-text-4" id="text-org07f40e8">
<p>
これは思考の「<a href="file:///wiki/%E6%A6%82%E5%BF%B5">概念</a>」「<a href="file:///wiki/%E5%88%A4%E6%96%AD">判断</a>」「<a href="file:///wiki/%E6%8E%A8%E7%90%86">推理</a>」を言語の「<a href="file:///wiki/%E5%90%8D%E8%BE%9E">名辞</a>」「<a href="file:///wiki/%E5%91%BD%E9%A1%8C">命題</a>」「<a href="file:///wiki/%E6%8E%A8%E8%AB%96">推論</a>」の
作用と対応させている。
</p>

<ul class="org-ul">
<li>思考は先ず、「概念(concept)」の形成から始まる。

<ul class="org-ul">
<li>これは複数の対象に共通する特徴を把握し、それらを包括的・概括的に認
識することにあり、対象群を<a href="file:///wiki/%E6%8A%BD%E8%B1%A1%E5%8C%96">抽象化</a>する過程、本質的な<a href="file:///wiki/%E7%89%B9%E5%BE%B4">特徴</a>を見極めるこ
とでもある。</li>

<li>この把握された特徴は言葉によって表され（「名辞」）、概念として認識さ
れることになる。</li>

<li>このような特徴は、名辞された言葉が持つ意味内容と紐付けされた内包
(intension) 要素と、言葉が適用される対象の範囲を示す外延 (extension)
要素の2つで構成される。</li>
</ul></li>

<li>概念が構成されると、次にそれらを組み合わせて大きな<a href="file:///wiki/%E5%8D%98%E4%BD%8D">単位</a>を作る段階であ
る「判断(judgment)」 ‐言語単位では「命題(proposition)」‐に入る。

<ul class="org-ul">
<li>これは対象である存在 (being) とその性質や特徴
を示す属性(attribute) または複数の対象間にある関係 (relation)について、
<a href="file:///wiki/%E4%B8%BB%E8%AA%9E">主語</a>‐<a href="file:///wiki/%E5%AE%A2%E8%AA%9E">客語</a>‐<a href="file:///w/index.php?title=%E9%80%A3%E8%BE%9E&amp;action=edit&amp;redlink=1">連辞</a>という<a href="file:///wiki/%E6%96%87%E7%AB%A0">文章</a>形式で組み立てられる。</li>
</ul></li>

<li>判断が構成されると、次にこれを前提に置いて結論が導き出される。

<ul class="org-ul">
<li>この過程は「推理(inference)」‐言語単位では「推論」‐と呼ばれ、ひとつ以上の<a href="file:///wiki/%E7%9C%9F%E5%AE%9F">真実</a>と思わ
れる判断を元に、別の判断を真実とみなす思考の作用である。</li>

<li>この推理を進める方法には、<a href="file:///wiki/%E7%B5%8C%E9%A8%93">経験</a>を排除し<a href="file:///wiki/%E8%AB%96%E7%90%86">論理</a>に基づいて結論を導く<a href="file:///wiki/%E6%BC%94%E7%B9%B9">演繹</a>
的推理と、個別事情を勘案しそこから一般的な結論を見出す<a href="file:///wiki/%E5%B8%B0%E7%B4%8D">帰納</a>的推理が
ある。</li>

<li>推論の種類には、ひとつの判断から直接的に別の判断の真偽を判定する直
接推論と、いわゆる三段論法にように2つの判断から結論を導く間接推論がある。</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf87f39e" class="outline-3">
<h3 id="orgf87f39e">思考の種類</h3>
<div class="outline-text-3" id="text-orgf87f39e">
<p>
以下ではいくつかの例を示す。
</p>
</div>

<div id="outline-container-org0161da6" class="outline-4">
<h4 id="org0161da6">論理的思考</h4>
<div class="outline-text-4" id="text-org0161da6">
<p>
定義は様々である。これについて井上尚美は、3つの定義を
提唱した。
</p>
<ul class="org-ul">
<li>狭義では推論が<a href="file:///wiki/%E5%BD%A2%E5%BC%8F%E8%AB%96%E7%90%86%E5%AD%A6">形式論理学</a>の規則に従っている事を挙げ、</li>
<li>次に論証 の形式である前提‐結論や主張‐理由という骨格がある事、</li>
<li>広義には直感やイメージからの思考ではなく概念的思考である事として
いる</li>
</ul>

<p>
この論理的思考は、
</p>

<ul class="org-ul">
<li>直感的発想にある正確性や明示性に欠ける点を補い、</li>
<li>妥当なものかどうかを確認・察知する有効な手段であり、</li>
<li>前提を漏れなく明示しつつ真偽を検証し、</li>
<li>さらに推論のプロセスを明瞭にして検証可能な状態にすることができる</li>
</ul>

<p>
しかし、論理的思考で得られた結論が必ず正しいとは言い切れず、また絶対
に結論を得られるものではない点にも留意する必要がある
</p>
</div>
</div>

<div id="outline-container-orgeca022a" class="outline-4">
<h4 id="orgeca022a">批判的思考</h4>
<div class="outline-text-4" id="text-orgeca022a">
<p>
高等教育において重要な目標とされる
</p>

<p>
定義は明瞭ではなく、研究者の間でも把握概念に違いが見られる。
</p>

<p>
ひとつの有力な説明では「信じるもの、取るべき行動の判断を下に当たっ
て行う反省的思考」と言い、具体的な説明では「根拠に基づく評価と判断を行
う能力と意思」と言う。
</p>
</div>
</div>

<div id="outline-container-org636231e" class="outline-4">
<h4 id="org636231e">二分法的思考</h4>
<div class="outline-text-4" id="text-org636231e">
<p>
「白黒はっきりつける」「ものの善悪」など、二律背反で事象を思考する
傾向をと言う。これは情報の理解や思考の結果である判断を素早く下せる
利点があるが、一方でパーソナリティ障害や完全主義および<a href="file:///wiki/%E4%BA%BA%E9%96%93%E9%96%A2%E4%BF%82">人間関係</a>の悪
化に繋がる場合もある。二分法的思考は、物事を明確にしたいという「二
分法の選好」、物事は2つの<a href="file:///wiki/%E3%82%B0%E3%83%AB%E3%83%BC%E3%83%97">グループ</a>に分けられるという「二分法的信念」、
そして自分にとって<a href="file:///wiki/%E5%88%A9%E7%9B%8A">利益</a>があるものか否かという「損得勘定」の3つの因
子が影響している。
</p>
</div>
</div>

<div id="outline-container-orga869dc1" class="outline-4">
<h4 id="orga869dc1">集団思考</h4>
<div class="outline-text-4" id="text-orga869dc1">
<p>
心理学者の<a href="file:///wiki/%E3%82%A2%E3%83%BC%E3%83%B4%E3%82%A3%E3%83%B3%E3%82%B0%E3%83%BB%E3%82%B8%E3%83%A3%E3%83%8B%E3%82%B9">アーヴィング・ジャニス</a>が提唱した「<a href="file:///wiki/%E9%9B%86%E5%9B%A3%E6%80%9D%E8%80%83">集団思考</a>」（Groupthink、
集団的浅慮）は、集団で思考して得た結論が、時に個人の思考で導いた結論よ
りも不合理であったり間違っていたりすることを指す。
</p>

<p>
このようなことが起こる要因は、集団に結束力があること(cohesive) と、
集団が一致を求める傾向にあること (concurrence-seeking tendency) が
ある。これを社会心理学的実験で検証したR.S.バロンは、各人が個別に否
定的な情報を持っているような場合に、集団の一致性を志向する傾向が高
まり、異論が封殺されるという結果を得た。逆に、コンピュータを介して
<a href="file:///wiki/%E5%8C%BF%E5%90%8D">匿名</a>のまま議論をする場合には集団思考の傾向は現れにくくなるという結果も
あった。
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: suzuki@iwate-u.ac.jp</p>
<p class="date">Created: 2019-12-09 月 11:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
